Applying:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # grafana_dashboard.dev["dev.json"] will be created
  + resource "grafana_dashboard" "dev" {
      + config_json  = jsonencode(
            {
              + annotations          = {
                  + list = [
                      + {
                          + builtIn    = 1
                          + datasource = {
                              + type = "grafana"
                              + uid  = "-- Grafana --"
                            }
                          + enable     = true
                          + hide       = true
                          + iconColor  = "rgba(0, 211, 255, 1)"
                          + name       = "Annotations & Alerts"
                          + target     = {
                              + limit    = 100
                              + matchAny = false
                              + tags     = []
                              + type     = "dashboard"
                            }
                          + type       = "dashboard"
                        },
                    ]
                }
              + editable             = true
              + fiscalYearStartMonth = 0
              + graphTooltip         = 0
              + links                = []
              + liveNow              = false
              + panels               = [
                  + {
                      + datasource  = {
                          + type = "influxdb"
                          + uid  = "xLNPLcX7z"
                        }
                      + description = "Air sensor sample data from InfluxDB https://docs.influxdata.com/influxdb/cloud/reference/sample-data/#air-sensor-sample-data"
                      + fieldConfig = {
                          + defaults  = {
                              + color      = {
                                  + mode = "palette-classic"
                                }
                              + custom     = {
                                  + axisLabel         = ""
                                  + axisPlacement     = "auto"
                                  + barAlignment      = 0
                                  + drawStyle         = "line"
                                  + fillOpacity       = 0
                                  + gradientMode      = "none"
                                  + hideFrom          = {
                                      + legend  = false
                                      + tooltip = false
                                      + viz     = false
                                    }
                                  + lineInterpolation = "linear"
                                  + lineStyle         = {
                                      + fill = "solid"
                                    }
                                  + lineWidth         = 1
                                  + pointSize         = 5
                                  + scaleDistribution = {
                                      + type = "linear"
                                    }
                                  + showPoints        = "auto"
                                  + spanNulls         = false
                                  + stacking          = {
                                      + group = "A"
                                      + mode  = "none"
                                    }
                                  + thresholdsStyle   = {
                                      + mode = "off"
                                    }
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                            }
                          + overrides = [
                              + {
                                  + __systemRef = "hideSeriesFrom"
                                  + matcher     = {
                                      + id      = "byNames"
                                      + options = {
                                          + mode     = "exclude"
                                          + names    = [
                                              + "co TLM0102",
                                            ]
                                          + prefix   = "All except:"
                                          + readOnly = true
                                        }
                                    }
                                  + properties  = [
                                      + {
                                          + id    = "custom.hideFrom"
                                          + value = {
                                              + legend  = false
                                              + tooltip = false
                                              + viz     = true
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      + gridPos     = {
                          + h = 17
                          + w = 24
                          + x = 0
                          + y = 0
                        }
                      + options     = {
                          + legend  = {
                              + calcs       = []
                              + displayMode = "list"
                              + placement   = "bottom"
                            }
                          + tooltip = {
                              + mode = "single"
                              + sort = "none"
                            }
                        }
                      + targets     = [
                          + {
                              + datasource = {
                                  + type = "influxdb"
                                  + uid  = "xLNPLcX7z"
                                }
                              + query      = <<-EOT
                                    import "influxdata/influxdb/sample"
                                    sample.data(set: "airSensor")
                                    	|> range(start: v.timeRangeStart, stop: v.timeRangeStop)
                                      |> filter(fn: (r) => r["_measurement"] == "airSensors")
                                      |> filter(fn: (r) => r["_field"] == "temperature" or r["_field"] == "humidity" or r["_field"] == "co")
                                EOT
                              + refId      = "A"
                            },
                        ]
                      + title       = "Air Sensors"
                      + type        = "timeseries"
                    },
                ]
              + refresh              = false
              + schemaVersion        = 36
              + style                = "dark"
              + tags                 = []
              + templating           = {
                  + list = []
                }
              + time                 = {
                  + from = "2022-06-21T17:05:46.978Z"
                  + to   = "2022-06-21T17:53:35.857Z"
                }
              + timepicker           = {}
              + timezone             = ""
              + title                = "Devs"
              + uid                  = "9uim8cafdujnk"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_dashboard.production["prod.json"] will be created
  + resource "grafana_dashboard" "production" {
      + config_json  = jsonencode(
            {
              + annotations          = {
                  + list = [
                      + {
                          + builtIn    = 1
                          + datasource = {
                              + type = "grafana"
                              + uid  = "-- Grafana --"
                            }
                          + enable     = true
                          + hide       = true
                          + iconColor  = "rgba(0, 211, 255, 1)"
                          + name       = "Annotations & Alerts"
                          + target     = {
                              + limit    = 100
                              + matchAny = false
                              + tags     = []
                              + type     = "dashboard"
                            }
                          + type       = "dashboard"
                        },
                    ]
                }
              + editable             = true
              + fiscalYearStartMonth = 0
              + graphTooltip         = 0
              + links                = []
              + liveNow              = false
              + panels               = [
                  + {
                      + datasource  = {
                          + type = "influxdb"
                          + uid  = "xLNPLcX7z"
                        }
                      + description = "Air sensor sample data from InfluxDB https://docs.influxdata.com/influxdb/cloud/reference/sample-data/#air-sensor-sample-data"
                      + fieldConfig = {
                          + defaults  = {
                              + color      = {
                                  + mode = "palette-classic"
                                }
                              + custom     = {
                                  + axisLabel         = ""
                                  + axisPlacement     = "auto"
                                  + barAlignment      = 0
                                  + drawStyle         = "line"
                                  + fillOpacity       = 0
                                  + gradientMode      = "none"
                                  + hideFrom          = {
                                      + legend  = false
                                      + tooltip = false
                                      + viz     = false
                                    }
                                  + lineInterpolation = "linear"
                                  + lineStyle         = {
                                      + fill = "solid"
                                    }
                                  + lineWidth         = 1
                                  + pointSize         = 5
                                  + scaleDistribution = {
                                      + type = "linear"
                                    }
                                  + showPoints        = "auto"
                                  + spanNulls         = false
                                  + stacking          = {
                                      + group = "A"
                                      + mode  = "none"
                                    }
                                  + thresholdsStyle   = {
                                      + mode = "off"
                                    }
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                            }
                          + overrides = [
                              + {
                                  + __systemRef = "hideSeriesFrom"
                                  + matcher     = {
                                      + id      = "byNames"
                                      + options = {
                                          + mode     = "exclude"
                                          + names    = [
                                              + "co TLM0102",
                                            ]
                                          + prefix   = "All except:"
                                          + readOnly = true
                                        }
                                    }
                                  + properties  = [
                                      + {
                                          + id    = "custom.hideFrom"
                                          + value = {
                                              + legend  = false
                                              + tooltip = false
                                              + viz     = true
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      + gridPos     = {
                          + h = 17
                          + w = 24
                          + x = 0
                          + y = 0
                        }
                      + options     = {
                          + legend  = {
                              + calcs       = []
                              + displayMode = "list"
                              + placement   = "bottom"
                            }
                          + tooltip = {
                              + mode = "single"
                              + sort = "none"
                            }
                        }
                      + targets     = [
                          + {
                              + datasource = {
                                  + type = "influxdb"
                                  + uid  = "xLNPLcX7z"
                                }
                              + query      = <<-EOT
                                    import "influxdata/influxdb/sample"
                                    sample.data(set: "airSensor")
                                    	|> range(start: v.timeRangeStart, stop: v.timeRangeStop)
                                      |> filter(fn: (r) => r["_measurement"] == "airSensors")
                                      |> filter(fn: (r) => r["_field"] == "temperature" or r["_field"] == "humidity" or r["_field"] == "co")
                                EOT
                              + refId      = "A"
                            },
                        ]
                      + title       = "Air Sensors"
                      + type        = "timeseries"
                    },
                ]
              + refresh              = false
              + schemaVersion        = 36
              + style                = "dark"
              + tags                 = []
              + templating           = {
                  + list = []
                }
              + time                 = {
                  + from = "2022-06-21T17:05:46.978Z"
                  + to   = "2022-06-21T17:53:35.857Z"
                }
              + timepicker           = {}
              + timezone             = ""
              + title                = "Production dashboard"
              + uid                  = "9uim8cunk"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_dashboard.staging["stag.json"] will be created
  + resource "grafana_dashboard" "staging" {
      + config_json  = jsonencode(
            {
              + annotations          = {
                  + list = [
                      + {
                          + builtIn    = 1
                          + datasource = {
                              + type = "grafana"
                              + uid  = "-- Grafana --"
                            }
                          + enable     = true
                          + hide       = true
                          + iconColor  = "rgba(0, 211, 255, 1)"
                          + name       = "Annotations & Alerts"
                          + target     = {
                              + limit    = 100
                              + matchAny = false
                              + tags     = []
                              + type     = "dashboard"
                            }
                          + type       = "dashboard"
                        },
                    ]
                }
              + editable             = true
              + fiscalYearStartMonth = 0
              + graphTooltip         = 0
              + links                = []
              + liveNow              = false
              + panels               = [
                  + {
                      + datasource  = {
                          + type = "influxdb"
                          + uid  = "xLNPLcX7z"
                        }
                      + description = "Air sensor sample data from InfluxDB https://docs.influxdata.com/influxdb/cloud/reference/sample-data/#air-sensor-sample-data"
                      + fieldConfig = {
                          + defaults  = {
                              + color      = {
                                  + mode = "palette-classic"
                                }
                              + custom     = {
                                  + axisLabel         = ""
                                  + axisPlacement     = "auto"
                                  + barAlignment      = 0
                                  + drawStyle         = "line"
                                  + fillOpacity       = 0
                                  + gradientMode      = "none"
                                  + hideFrom          = {
                                      + legend  = false
                                      + tooltip = false
                                      + viz     = false
                                    }
                                  + lineInterpolation = "linear"
                                  + lineStyle         = {
                                      + fill = "solid"
                                    }
                                  + lineWidth         = 1
                                  + pointSize         = 5
                                  + scaleDistribution = {
                                      + type = "linear"
                                    }
                                  + showPoints        = "auto"
                                  + spanNulls         = false
                                  + stacking          = {
                                      + group = "A"
                                      + mode  = "none"
                                    }
                                  + thresholdsStyle   = {
                                      + mode = "off"
                                    }
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                            }
                          + overrides = [
                              + {
                                  + __systemRef = "hideSeriesFrom"
                                  + matcher     = {
                                      + id      = "byNames"
                                      + options = {
                                          + mode     = "exclude"
                                          + names    = [
                                              + "co TLM0102",
                                            ]
                                          + prefix   = "All except:"
                                          + readOnly = true
                                        }
                                    }
                                  + properties  = [
                                      + {
                                          + id    = "custom.hideFrom"
                                          + value = {
                                              + legend  = false
                                              + tooltip = false
                                              + viz     = true
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      + gridPos     = {
                          + h = 17
                          + w = 24
                          + x = 0
                          + y = 0
                        }
                      + options     = {
                          + legend  = {
                              + calcs       = []
                              + displayMode = "list"
                              + placement   = "bottom"
                            }
                          + tooltip = {
                              + mode = "single"
                              + sort = "none"
                            }
                        }
                      + targets     = [
                          + {
                              + datasource = {
                                  + type = "influxdb"
                                  + uid  = "xLNPLcX7z"
                                }
                              + query      = <<-EOT
                                    import "influxdata/influxdb/sample"
                                    sample.data(set: "airSensor")
                                    	|> range(start: v.timeRangeStart, stop: v.timeRangeStop)
                                      |> filter(fn: (r) => r["_measurement"] == "airSensors")
                                      |> filter(fn: (r) => r["_field"] == "temperature" or r["_field"] == "humidity" or r["_field"] == "co")
                                EOT
                              + refId      = "A"
                            },
                        ]
                      + title       = "Air Sensors"
                      + type        = "timeseries"
                    },
                ]
              + refresh              = false
              + schemaVersion        = 36
              + style                = "dark"
              + tags                 = []
              + templating           = {
                  + list = []
                }
              + time                 = {
                  + from = "2022-06-21T17:05:46.978Z"
                  + to   = "2022-06-21T17:53:35.857Z"
                }
              + timepicker           = {}
              + timezone             = ""
              + title                = "Stagings"
              + uid                  = "9uim8cunk"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_folder.Dev will be created
  + resource "grafana_folder" "Dev" {
      + id    = (known after apply)
      + title = "Dev"
      + uid   = (known after apply)
      + url   = (known after apply)
    }

  # grafana_folder.Production will be created
  + resource "grafana_folder" "Production" {
      + id    = (known after apply)
      + title = "Production"
      + uid   = (known after apply)
      + url   = (known after apply)
    }

  # grafana_folder.Staging will be created
  + resource "grafana_folder" "Staging" {
      + id    = (known after apply)
      + title = "Staging"
      + uid   = (known after apply)
      + url   = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```